In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [4]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       891 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [5]:
X = df.drop(columns=['PassengerId', 'Survived', 'Name', 'Ticket', 'Cabin'])
y = df['Survived']

In [6]:
X.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [7]:
X.describe()

           Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  891.000000  891.000000  891.000000
mean     2.308642   29.699118    0.523008    0.381594   32.204208
std      0.836071   13.002015    1.102743    0.806057   49.693429
min      1.000000    0.420000    0.000000    0.000000    0.000000
25%      2.000000   22.000000    0.000000    0.000000    7.910400
50%      3.000000   29.699118    0.000000    0.000000   14.454200
75%      3.000000   35.000000    1.000000    0.000000   31.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200

In [8]:
from sklearn.preprocessing import LabelEncoder

cat_features = ['Sex', 'Embarked']

for col in cat_features:
    lbl = LabelEncoder()
    X[col] = lbl.fit_transform(list(df[col].values))

In [9]:
X.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  22.0      1      0   7.2500         2
1       1    0  38.0      1      0  71.2833         0
2       3    0  26.0      0      0   7.9250         2
3       1    0  35.0      1      0  53.1000         2
4       3    1  35.0      0      0   8.0500         2

In [10]:
from sklearn.preprocessing import StandardScaler

num_features = ['Age', 'Fare']

for col in num_features:
    scaler = StandardScaler()
    X[col] = scaler.fit_transform(np.array(X[col].values).reshape(-1, 1))
    
X.head()

   Pclass  Sex       Age  SibSp  Parch      Fare  Embarked
0       3    1 -0.592481      1      0 -0.502445         2
1       1    0  0.638789      1      0  0.786845         0
2       3    0 -0.284663      0      0 -0.488854         2
3       1    0  0.407926      1      0  0.420730         2
4       3    1  0.407926      0      0 -0.486337         2

In [11]:
print(X['Pclass'].value_counts())

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [12]:
print(X['SibSp'].value_counts())

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [13]:
print(X['Embarked'].value_counts())

2    646
0    168
1     77
Name: Embarked, dtype: int64

In [14]:
X = pd.get_dummies(X, columns=['Pclass', 'SibSp', 'Embarked'], drop_first=True)
X.head()

,Sex,Age,Parch,Fare,Pclass_2,Pclass_3,SibSp_1,SibSp_2,SibSp_3,SibSp_4,SibSp_5,SibSp_8,Embarked_1,Embarked_2
0,1,-0.592481,0,-0.502445,0,1,1,0,0,0,0,0,0,1
1,0,0.638789,0,0.786845,0,0,1,0,0,0,0,0,0,0
2,0,-0.284663,0,-0.488854,0,1,0,0,0,0,0,0,0,1
3,0,0.407926,0,0.420730,0,0,1,0,0,0,0,0,0,1
4,1,0.407926,0,-0.486337,0,1,0,0,0,0,0,0,0,1

In [15]:
from sklearn.svm import SVC
from sklearn.model_selection import train_test_split

In [16]:
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=0)

svm = SVC().fit(X_train, y_train)

svm.score(X_test, y_test)

0.8026905829596412

In [17]:
best_score = 0

for C in [1, 10, 100, 1000, 10000, 100000, 1000000]:
    svm = SVC(C=C).fit(X_train, y_train)
    score = svm.score(X_train, y_train)
    
    if score > best_score:
        best_score = score
        best_parameter = C
        
print(best_score)
print(best_parameter)

0.9191616766467066
1000000

In [19]:
X_train_, X_validation, y_train_, y_validation = train_test_split(X_train, y_train, random_state=0)

In [20]:
best_score = 0

for C in [1, 10, 100, 1000, 10000, 100000, 1000000]:
    svm = SVC(C=C).fit(X_train_, y_train_)
    score = svm.score(X_validation, y_validation)
    
    if score > best_score:
        best_score = score
        best_parameter = C
        
svm = SVC(C=best_parameter).fit(X_train, y_train)
print(best_parameter)
print(svm.score(X_test, y_test))

10
0.8071748878923767

In [21]:
print(best_parameter)

10

In [22]:
from sklearn.model_selection import GridSearchCV

In [23]:
param = {
    'C': [0.001, 0.01, 0.1, 1, 10]
}

grid_search = GridSearchCV(SVC(), param_grid=param, cv=5)
grid_search.fit(X_train, y_train)

GridSearchCV(cv=5, error_score='raise',
       estimator=SVC(C=1.0, cache_size=200, class_weight=None, coef0=0.0,
  decision_function_shape='ovr', degree=3, gamma='auto', kernel='rbf',
  max_iter=-1, probability=False, random_state=None, shrinking=True,
  tol=0.001, verbose=False),
       fit_params=None, iid=True, n_jobs=1,
       param_grid={'C': [0.001, 0.01, 0.1, 1, 10]},
       pre_dispatch='2*n_jobs', refit=True, return_train_score='warn',
       scoring=None, verbose=0)

In [24]:
grid_search.best_params_

{'C': 10}

In [25]:
grid_search.score(X_test, y_test)

0.8071748878923767

In [26]:
from sklearn.model_selection import cross_val_score

In [27]:
scores = cross_val_score(GridSearchCV(SVC(), param_grid=param, cv=5), X, y, cv=5)
print(scores)

[0.82681564 0.82122905 0.80898876 0.79213483 0.85310734]

In [28]:
scores.mean()

0.8204551265751633